02_Modelagem_UML_Astah/UC06_Acompanhar_Desempenho/UC06_Sequencia.puml
@startuml
skinparam monochrome true
autonumber
participant T as ":Tutor"
participant D as ":PainelVisual"
participant A as ":Aluno"
T -> D : visualizar(id)
activate D
D -> A : obterMetricas()
A --/ D : dados
D --/ T : Relatório Visual
deactivate D
@enduml
